[
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 1,
    "text": "UNIT II PHYSICAL AND DATA LINK LAYERS 9 \nWired and wireless media – Functions of physical layer – Modems – Transmission errors – \nError detection and correction – Framing - Flow control – Sublayers of DLL – Broadcast \nnetworks – Collision Domain - Ethernet – CSMA/CD – Token Ring – VLAN – LAN Analyzer – \nIEEE 802.11 - WLAN – CSMA/CA – Bluetooth – Ad hoc networks. Unit II: Physical and Data Link Layers with a focus on Wired and Wireless Media, \nPhysical Layer, and Data Link Layer (DLL): \nWired and Wireless Media: \n• Wired Media: \no Physical cables (e.g., twisted pair, coaxial cable, fiber optics) used for data \ntransmission. o Advantages: Higher speed, lower interference. o Disadvantages: Limited mobility, installation cost. • Wireless Media: \no Uses electromagnetic waves (e.g., radio waves, microwaves) for \ncommunication. o Advantages: Mobility, easy to install. o Disadvantages: More prone to interference and security issues, lower \nbandwidth. Functions of the Physical Layer: \n• Responsible for the transmission of raw bits over a communication medium. • Converts digital data into signals (electrical, optical, or radio) for transmission. • Ensures that signals are correctly encoded, modulated, and transmitted. • Handles hardware elements like cables, connectors, and signal synchronization. Modems: \n• Modulator-Demodulator: Converts digital data from a computer into analog \nsignals for transmission over analog communication lines (like phone lines) and \nvice versa."
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 2,
    "text": "• Role: Enables computers to communicate over long distances using telephone \ninfrastructure. Transmission Errors: \n• Transmission errors occur when data is corrupted during transmission due to \nfactors like noise, attenuation, or interference. • Bit errors may occur when a ‘1’ is mistaken for a ‘0’ or vice versa. Error Detection and Correction: \n• Error Detection: Methods to detect errors in transmitted data, ensuring data \nintegrity. o Techniques: Parity Check, Checksum, Cyclic Redundancy Check (CRC). • Error Correction: Methods to not only detect but also correct errors in \ntransmission. o Techniques: Hamming Code, Reed-Solomon Codes. Framing (Data Link Layer): \n• Framing refers to dividing the stream of bits into smaller, manageable units called \nframes. • Allows for synchronization between sender and receiver, and error detection can be \napplied on individual frames. Flow Control: \n• Mechanism to ensure that a sender doesn’t overwhelm a receiver by sending data \ntoo fast. o Examples: Stop-and-Wait Protocol, Sliding Window Protocol. Sublayers of Data Link Layer (DLL): \n1. Logical Link Control (LLC): Provides error checking, flow control, and manages \ndata exchange between devices. 2. Media Access Control (MAC): Controls how devices on a network gain access to \nthe medium and permission to transmit data. It uses physical addressing (MAC \naddresses)."
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 3,
    "text": "Broadcast Networks: \n• Networks where data sent by one device can be received by all other devices in the \nnetwork (e.g., Ethernet LAN). • Broadcast networks rely on protocols like CSMA/CD to manage multiple devices \ntransmitting on the same network medium. Collision Domain: \n• A network segment where data packets can collide when multiple devices \ntransmit simultaneously. • Hubs increase the size of a collision domain, while switches segment it, reducing \ncollisions and improving efficiency. Ethernet: \n• A widely used wired LAN technology that uses twisted pair cables or fiber optics. • Operates primarily at the data link layer and the physical layer. CSMA/CD (Carrier Sense Multiple Access with Collision Detection): \n• A protocol used in Ethernet networks to manage access to the shared medium. • CSMA: Devices sense the carrier (the medium) to see if it’s free before transmitting. • CD: If two devices transmit simultaneously and a collision occurs, they stop, wait a \nrandom amount of time, and retransmit. Ethernet and Related Concepts: \n• Ethernet: A widely used wired LAN technology based on the CSMA/CD protocol. • CSMA/CD (Carrier Sense Multiple Access with Collision Detection): A protocol \nfor managing data collisions in wired networks. Devices listen to the network before \ntransmitting and detect collisions to retransmit the data. • Token Ring: A LAN protocol where a token circulates in the network, and only the \ndevice holding the token can transmit data, preventing collisions. • VLAN (Virtual Local Area Network): Logical segmentation of a LAN into multiple, \nisolated broadcast domains, improving security and reducing broadcast traffic. • LAN Analyzer: A tool used to monitor, analyze, and troubleshoot LAN traffic."
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 4,
    "text": "Wireless Networking Concepts: \n• IEEE 802.11 WLAN: The standard for wireless LANs, commonly known as Wi-Fi. It \nprovides wireless connectivity between devices using access points. • CSMA/CA (Carrier Sense Multiple Access with Collision Avoidance): A protocol \nfor wireless networks where devices avoid collisions by waiting for a clear channel \nbefore transmitting. • Bluetooth: A short-range wireless technology used for connecting devices like \nphones, laptops, and peripherals. • Ad Hoc Networks: Decentralized wireless networks where devices communicate \ndirectly without relying on a fixed infrastructure (e.g., Wi-Fi Direct, Bluetooth). ***************************************Wired Media \nWired media refers to physical cables that transmit data using electrical or optical signals. They are typically used for local area networks (LANs), data centers, and various \ntelecommunications applications. Types of Wired Media: \n1. Twisted Pair Cable: \na. Description: Consists of pairs of insulated copper wires twisted together to \nreduce electromagnetic interference. b. Categories: \ni. Cat 5e: Supports speeds up to 1 Gbps for short distances. ii. Cat 6/6a: Supports speeds up to 10 Gbps for distances up to 55 \nmeters (Cat 6) and up to 100 meters (Cat 6a). c. Applications: Commonly used in Ethernet networks. 2. Coaxial Cable: \na. Description: Composed of a central conductor, insulating layer, metallic \nshield, and outer cover. b. Bandwidth: Higher bandwidth capacity than twisted pair cables. c. Applications: Used in cable television, internet connections, and some \nLANs. 3. Fiber Optic Cable: \na. Description: Composed of thin strands of glass or plastic (optical fibers) \nthat transmit data as light signals. b. Types:"
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 5,
    "text": "i. Single-mode Fiber: Suitable for long-distance communication (up to \n40 km or more) with higher bandwidth. ii. Multi-mode Fiber: Suitable for shorter distances (up to 2 km) and \nlower bandwidth applications. c. Applications: High-speed internet connections, data centers, backbone \nnetworks. Advantages of Wired Media: \n• Higher Speeds: Generally provide faster data transfer rates compared to wireless \nmedia. • Lower Latency: Less prone to delays in transmission. • Security: More secure than wireless as physical access to cables is required to \nintercept data. • Reliability: Less susceptible to interference from external factors like \nelectromagnetic interference (EMI). Disadvantages of Wired Media: \n• Mobility: Limited mobility; devices must be physically connected to the network. • Installation Costs: Can be more expensive to install due to the need for cabling \nand infrastructure. • Physical Limitations: Limited by distance; signal quality can degrade over long \ndistances. Wireless Media \nWireless media refers to data transmission methods that use electromagnetic waves to \ntransmit data without physical cables. Wireless networks are widely used for mobile \ncommunication, internet access, and local networking. Types of Wireless Media: \n1. Radio Waves: \na. Description: Use radio frequency (RF) signals to transmit data over the air. b. Applications: Wi-Fi networks, Bluetooth devices, and cellular networks. 2. Microwaves:"
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 6,
    "text": "a. Description: Higher frequency than radio waves; used for point-to-point \ncommunication. b. Applications: Satellite communications, microwave relay links. 3. Infrared: \na. Description: Uses infrared light for short-range communication. b. Applications: Remote controls, some wireless peripherals (e.g., wireless \nmice). 4. Li-Fi: \na. Description: Uses visible light for data transmission. b. Applications: Emerging technology for high-speed wireless communication \nin environments where RF communication is not feasible. Advantages of Wireless Media: \n• Mobility: Allows devices to connect to the network without being physically \ntethered. • Easy Installation: Generally easier and quicker to deploy since no cabling is \nrequired. • Flexibility: Supports a range of devices, including mobile phones, tablets, and \nlaptops. Disadvantages of Wireless Media: \n• Speed Limitations: Generally slower than wired media due to factors like signal \ndegradation and interference. • Interference: Susceptible to interference from other devices, obstacles, and \nenvironmental factors. • Security Risks: More vulnerable to eavesdropping and unauthorized access if not \nproperly secured. Summary \nFeature \nWired Media \nWireless Media \nTypes \nTwisted pair, coaxial, fiber \noptic \nRadio waves, microwaves, infrared, Li-\nFi \nSpeed \nGenerally higher speeds \nGenerally lower speeds \nLatency \nLower latency \nHigher latency"
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 7,
    "text": "Mobility \nLimited mobility \nHigh mobility \nInstallation More complex, higher cost \nEasier, lower cost \nReliability \nMore reliable, less \ninterference \nLess reliable, more prone to \ninterference \nSecurity \nMore secure \nMore vulnerable to security threats \nBoth wired and wireless media play crucial roles in modern networking. The choice \nbetween them depends on specific use cases, performance requirements, and \nenvironmental considerations. ************************************************************************8 \n \nTransmission Errors in Data Communication \nTransmission errors occur when data is corrupted during the transmission process from a \nsender to a receiver. These errors can result from various factors, including: \n• Noise: Interference from electrical devices, environmental conditions, or physical \nobstructions. • Signal Degradation: Loss of signal strength over long distances, especially in wired \ncommunications. • Interference: External electromagnetic interference from other devices or \nnetworks. • Packet Loss: Loss of data packets due to network congestion or faulty hardware. To ensure the integrity of transmitted data, error detection and correction mechanisms are \nemployed. Error Detection \n1. Parity Check \n• Example: \no Let's say we have a 4-bit data sequence: 1011. \no Even Parity: The number of 1's in 1011 is 3 (odd). To make it even, we add a \nparity bit of 1. The transmitted data becomes 10111."
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 8,
    "text": "o Receiver's Check: The receiver gets 10111, counts the number of 1's (which \nis now 4), and determines that the parity is even, so it assumes there is no \nerror. o If the received sequence is 10011 (where one bit has changed), the number \nof 1's is 3 (odd). The receiver detects a discrepancy in parity, indicating an \nerror. 2. Checksum \n• Example: \no Consider a data packet consisting of two 8-bit bytes: 11010101 (213 in \ndecimal) and 01100010 (98 in decimal). o Checksum Calculation: \n▪ Add the two bytes: \n▪ 01100010 \n \n1 00110111 (Carry bit is ignored, resulting in 01101111) \nmarkdown \nCopy code \n- The checksum is the one's complement of the sum:  \n- One’s complement of `01101111` is `10010000` (144 in decimal). o Transmitted Data: The packet sent would be 11010101, 01100010, and \n10010000. \no Receiver's Check: \n▪ The receiver adds the two data bytes and the received checksum: \n▪ 01100010 \n▪ 10010000 \n \n1 00110111 (Again, ignoring the carry bit) \n \n- If the result is `11111111` (all bits 1), the data is considered \nvalid. If it’s anything else, an error is detected."
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 9,
    "text": "3. Cyclic Redundancy Check (CRC) \n• Example: \no Suppose we want to send the data 1101 using a divisor polynomial 1011. \no Data: 1101 \no Append Zeros: Append n-1 zeros (where n is the degree of the divisor) to the \ndata. Thus, 1101000. \no Division: \n▪ Perform binary division of 1101000 by 1011. ▪ The remainder is calculated as 0010. \no Transmitted Data: The transmitted message is 11010010 (original data + \nCRC). o Receiver's Check: \n▪ The receiver performs the same division with the received data. If the \nremainder is 0, the data is assumed to be correct; if not, an error is \ndetected. Error Correction \n1. Hamming Code \n• Example: \no Consider a 4-bit data sequence: 1011. \no Step 1: Determine the number of redundant bits. For 4 data bits, you need 3 \nredundant bits (r bits satisfy 2r≥m+r+12^r \\geq m + r + 12r≥m+r+1 where \nm is data bits). o Step 2: Place redundant bits at positions 1, 2, and 4 (1-indexed): \nPosition:   1  2  3  4  5  6  7 \nBits:       r1 r2 1 r3  0  1 1 \n \no Step 3: Calculate redundant bits: \n▪ r1 covers positions 1, 3, 5, 7: r1 ⊕ 1 ⊕ 0 ⊕ 1 = 0 (thus, r1 = 0). ▪ r2 covers positions 2, 3, 6, 7: r2 ⊕ 1 ⊕ 1 ⊕ 1 = 0 (thus, r2 = 1). ▪ r3 covers positions 4, 5, 6, 7: r3 ⊕ 0 ⊕ 1 ⊕ 1 = 0 (thus, r3 = 0). o Final Code: The transmitted code is 0111011. • Step 4: Suppose the receiver receives 0111001 (the last bit is erroneous). o Calculate parity:"
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 10,
    "text": "▪ For r1: 0 ⊕ 1 ⊕ 0 ⊕ 1 = 0 (ok). ▪ For r2: 1 ⊕ 1 ⊕ 0 ⊕ 1 = 1 (error detected). ▪ For r3: 0 ⊕ 0 ⊕ 1 ⊕ 1 = 0 (ok). o The error is in position 3 (binary 011 indicates bit 3 is incorrect), so flip the bit \nto correct it: 0111011. 2. Reed-Solomon Code \n• Example: \no Suppose we have a message block of 7 bytes: ABCDEFG. o Encoding: \n▪ The original message is encoded by adding redundant bytes to allow \ncorrection. Let's say 3 redundant bytes are added, resulting in a total \nof 10 bytes (7 data + 3 redundant). o Transmission: The encoded message ABCDEFGXXX is sent. o Error Occurrence: Due to noise, the received message might be \nABZDEFGXXX (the third byte has been corrupted). o Correction: The receiver uses the redundant bytes to analyze and determine \nthe nature of the error. If the error is within the correctable limits, the \nreceiver can reconstruct the original data as ABCDEFG. Summary \n• Error Detection techniques like parity checks, checksums, and CRC help identify if \ndata has been corrupted during transmission. • Error Correction techniques such as Hamming codes and Reed-Solomon codes \nallow for identifying and correcting errors without needing retransmission. ********************************************************************************88 \nSublayers of Data Link Layer (DLL):  \nChatGPT said: \nChatGPT \nThe Data Link Layer (DLL) is the second layer of the OSI model and plays a critical role in \nfacilitating communication between devices on a local area network (LAN) or within a wide \narea network (WAN). The DLL is divided into two sublayers, each serving distinct functions:"
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 11,
    "text": "1. Logical Link Control (LLC) Sublayer \nFunctions: \n• Framing: The LLC sublayer is responsible for defining frame boundaries and \nmanaging frame synchronization. It encapsulates network layer packets into \nframes. • Flow Control: LLC provides mechanisms to control the rate of data transmission \nbetween sender and receiver, ensuring that a fast sender does not overwhelm a \nslow receiver. • Error Detection and Handling: It can provide basic error detection capabilities by \nchecking frame integrity through methods such as checksums or CRC. • Multiplexing: LLC allows multiple network layer protocols (e.g., IP, IPX) to coexist \nover the same physical medium by using service access points (SAPs) to distinguish \nbetween different protocols. Example: \n• In Ethernet networks, the LLC sublayer handles the communication between the \nnetwork layer (Layer 3) and the MAC (Media Access Control) sublayer by adding \nheaders and trailers to the data received from the network layer. 2. Media Access Control (MAC) Sublayer \nFunctions: \n• Access Control: The MAC sublayer is responsible for controlling how devices on a \nshared medium access the network. It determines when a device can transmit data \nand manages potential collisions. • Framing: Similar to the LLC, the MAC sublayer also frames the data, but its focus is \nmore on the format and addressing of the data for transmission. • Addressing: The MAC sublayer adds hardware addresses (MAC addresses) to \nframes, allowing devices to identify each other on the local network. • Error Detection: It can also incorporate error detection mechanisms, such as CRC, \nto ensure the integrity of the frames transmitted over the medium."
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 12,
    "text": "Example: \n• In Ethernet networks, the MAC sublayer determines how frames are sent over the \nnetwork using the Carrier Sense Multiple Access with Collision Detection \n(CSMA/CD) protocol. It also adds source and destination MAC addresses to the \nEthernet frames. Summary of Data Link Layer Sublayers \nSublayer \nFunctions \nResponsibilities \nLLC \n- Framing \n- Flow Control \n- Error Detection \n- Multiplexing \nManages communication between the network layer \nand the MAC sublayer, ensuring proper data \nencapsulation and control mechanisms. MAC \n- Access Control \n- Framing \n- Addressing \n- Error Detection \nControls how devices access the physical medium, \nformats frames for transmission, and adds \naddressing information. The separation of the Data Link Layer into these two sublayers allows for a more modular \napproach to network communication, providing flexibility and efficiency in managing data \ntransmission and access control on local networks. *******************************************************************************8 \nCSMA/CD (Carrier Sense Multiple Access with Collision Detection) \nCSMA/CD is a network protocol used in Ethernet networks to manage how devices share a \ncommunication medium. It is designed to reduce the chances of collisions when multiple \ndevices attempt to send data over the same medium. Here’s an overview of how CSMA/CD \nworks, its functioning, advantages, and disadvantages."
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 13,
    "text": "How CSMA/CD Works \n \n1. Carrier Sense: \na. Before a device sends data, it listens to the network (the communication \nmedium) to check if another device is currently transmitting. This is known \nas \"carrier sensing.\" b. If the channel is clear (no other transmissions detected), the device can \nproceed to transmit its data. 2. Data Transmission: \na. Once the medium is clear, the device begins to transmit its data. 3. Collision Detection: \na. While transmitting, the device continues to monitor the network for any \ncollisions. A collision occurs when two devices transmit data \nsimultaneously. b. If the device detects that the signals are garbled (due to a collision), it stops \ntransmitting immediately. 4. Jamming Signal: \na. Upon detecting a collision, the device sends a jamming signal to inform all \nother devices on the network that a collision has occurred. This helps ensure \nthat all devices are aware of the collision and can stop their transmissions. 5. Backoff Algorithm: \na. After the collision is detected and the jamming signal is sent, each device \ninvolved in the collision waits for a random amount of time before attempting"
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 14,
    "text": "to retransmit. This waiting period is calculated using the exponential backoff \nalgorithm, which increases the wait time after each subsequent collision. b. Once the backoff period has elapsed, the device returns to the carrier sense \nphase and checks the medium again before retransmitting. Advantages of CSMA/CD \n1. Efficient Use of Bandwidth: \na. CSMA/CD helps optimize bandwidth usage by allowing multiple devices to \nshare the medium without requiring a fixed time slot for each device. 2. Simplicity: \na. The protocol is relatively simple to implement, making it suitable for basic \nEthernet networks. 3. Cost-Effective: \na. CSMA/CD can reduce the costs associated with more complex network \naccess methods that require dedicated controllers or time-slotting \nmechanisms. Disadvantages of CSMA/CD \n1. Collision Inefficiency: \na. As the number of devices on the network increases, the likelihood of \ncollisions also increases, which can lead to network inefficiency and delays \nin data transmission. 2. Performance Degradation: \na. In high-traffic networks, the performance can degrade significantly due to \nincreased collisions and retransmissions, leading to a bottleneck effect. 3. Limited Scalability: \na. CSMA/CD is not well-suited for large networks or networks with high data \ntraffic, making it less effective as network demands grow. Applications of CSMA/CD \nCSMA/CD is primarily used in wired Ethernet networks (IEEE 802.3). While it was widely \nemployed in traditional bus and shared media Ethernet configurations, its use has"
  },
  {
    "unit": "Unit 2",
    "topic": "Notes",
    "source": "notes",
    "page": 15,
    "text": "diminished with the advent of switched Ethernet networks, which have largely eliminated \ncollisions by providing dedicated bandwidth to each device. Summary \nCSMA/CD is a protocol designed to manage how multiple devices share a communication \nmedium by listening for traffic before transmitting and detecting collisions during \ntransmission. While it offers several advantages in terms of efficiency and simplicity, it is \nlimited in scalability and performance in high-traffic situations. The evolution of network \ntechnologies, particularly the shift to full-duplex communication and switched networks, \nhas led to a decline in the use of CSMA/CD in modern networking."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 1,
    "text": "UNIT I DATA COMMUNICATION AND NETWORKING 9 \nData communication systems – Components and their functions - Building networks – \nHosts and - Networking devices – Switched Networks and Broadcast Networks – \nTransmission medium - Networking Devices: Hubs, Bridges, Switches, Routers, and \nGateways - Edge, Access and Core - networks – Role of software and hardware in \nnetworking – Layered Architecture – OSI and TCP/IP - Reference Models. Here’s an in-depth exploration of the key concepts in data communication systems and \nnetworking: \n1. Components of Data Communication Systems \n• Message: This is the information being transmitted between devices. It could be in \nthe form of text, audio, video, or other data types. Effective communication \ndepends on the accuracy and speed at which messages are sent and received. • Sender: The originator of the message, such as a computer or mobile device, that \nuses a transmission medium to send data. • Receiver: The destination of the message. It interprets the incoming data and \nprovides it to the end user or system application. • Transmission Medium: The channel through which the message is sent from \nsender to receiver. This can include: \no Wired Media: Like twisted-pair cables, coaxial cables, and fiber optic \ncables, providing high-speed, reliable connections. o Wireless Media: Such as radio waves, microwaves, and infrared, enabling \nflexible and mobile communication. • Protocol: A set of standardized rules that govern the communication between \ndevices, ensuring the data is formatted, transmitted, and received correctly. Examples include TCP/IP, HTTP, and FTP. 2. Building Networks \n• Networks are systems that interconnect devices to allow for the exchange of data. Networks can be as small as a few devices in a room or as large as the global \ninternet. • Hosts: These are devices connected to a network, including computers, \nsmartphones, servers, and IoT devices. Hosts typically generate, receive, or \nprocess data on a network."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 2,
    "text": "• Networking Devices: Devices like routers, switches, and hubs enable data \nmovement across networks by directing traffic efficiently and maintaining \nconnectivity among hosts. 3. Switched Networks and Broadcast Networks \n• Switched Networks: Utilize switches to route data to its intended recipient using \nMAC addresses. In switched networks, only the target device receives the data \npacket, leading to efficient use of bandwidth and enhanced privacy. • Broadcast Networks: Send data packets to all devices on the network segment. Each device checks the packet and processes it if it’s addressed to them. While \nsimple to implement, broadcast networks can be inefficient on larger scales due to \nunnecessary data processing. 4. Transmission Medium \n• Transmission mediums serve as the conduits for data communication and can vary \nwidely depending on the network’s requirements. • Wired Transmission: \no Twisted Pair Cables: Common in local area networks (LANs), they consist of \npairs of wires twisted together to reduce electromagnetic interference. o Coaxial Cables: Used for cable TV and internet, coaxial cables provide a \nshielded medium that reduces interference and supports high-frequency \nsignals. o Fiber Optic Cables: Provide very high bandwidth and long-distance \ncommunication using light signals, widely used for backbone networks and \nlong-distance telecommunications. • Wireless Transmission: \no Radio Waves: Enable wireless communication for Wi-Fi, cellular networks, \nand Bluetooth, offering flexibility and mobility. o Microwaves: Used for satellite communication and point-to-point links, \noffering higher bandwidth but requiring line-of-sight communication. 5. Networking Devices \n• Hubs: Basic devices that connect multiple devices in a network but broadcast all \nincoming data to every device, creating potential congestion."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 3,
    "text": "• Bridges: Devices that connect different segments of a network, filtering traffic \nbased on MAC addresses to reduce congestion and improve network performance. • Switches: Advanced versions of hubs, switches use MAC addresses to direct data \npackets only to the intended device, enhancing efficiency. • Routers: Operate at the network layer, forwarding data between different networks \nbased on IP addresses and determining the best path for data. • Gateways: Connect networks using different protocols, translating data from one \nprotocol to another to enable communication across different network \narchitectures. 6. Network Types \n• Edge Networks: These provide connectivity for end devices, often serving as the \npoint of entry to larger networks, such as internet service providers. • Access Networks: Typically provide local connectivity, such as a Wi-Fi network, \nallowing users to connect to other network resources and services. • Core Networks: Provide high-speed, reliable connections within the larger network, \noften functioning as the backbone for other network types and enabling long-\ndistance data transfer. 7. Role of Software and Hardware in Networking \n• Hardware: The physical infrastructure required for networking, including devices \nlike routers, switches, and cables, that support data movement. • Software: Includes operating systems, network protocols, and applications that \ncontrol how data is formatted, transmitted, and processed, ensuring effective \ncommunication between devices. 8. Layered Architecture – OSI and TCP/IP Models \n• OSI Model: \no A seven-layer model designed to standardize network functions. The layers \ninclude Physical, Data Link, Network, Transport, Session, Presentation, and \nApplication. o Each layer performs specific functions, with data moving through each layer, \nundergoing transformations and encapsulations to ensure successful \ndelivery. • TCP/IP Model:"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 4,
    "text": "o A simplified four-layer model used primarily for internet-based \ncommunications. The layers include Network Access, Internet, Transport, \nand Application. o The TCP/IP model focuses on practical implementation, with the Application \nlayer encompassing several OSI layers. In summary, data communication systems involve a complex interplay of components, \ntechnologies, and protocols that ensure data is efficiently, reliably, and securely \nexchanged across various network infrastructures. By understanding each element’s role, \nwe can build and maintain robust networks capable of supporting modern communication \nneeds. ************************************************************************************* \nTransmission mediums are essential components in any data communication system, as \nthey provide the pathway for data to travel between devices. These mediums can be \nbroadly classified into two categories: wired (guided) and wireless (unguided). Each \ncategory has various types, each with unique characteristics, advantages, and limitations. Here’s an in-depth look at different transmission mediums, \n1. Wired Transmission Mediums (Guided Media) \nWired transmission mediums involve physical cables that guide the data signals from the \nsender to the receiver. These include: \n• Twisted Pair Cable:"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 5,
    "text": "o Description: This cable consists of pairs of insulated copper wires twisted \ntogether to reduce electromagnetic interference. It is widely used in local \narea networks (LANs), telephone systems, and DSL connections. o Types: \n▪ Unshielded Twisted Pair (UTP): Common in Ethernet networks; \ninexpensive and easy to install. ▪ Shielded Twisted Pair (STP): Contains additional shielding to reduce \ninterference, offering better performance but at a higher cost. o Advantages: Inexpensive, easy to install, and widely available. o Limitations: Susceptible to interference and signal attenuation over long \ndistances. • Coaxial Cable: \no Description: Coaxial cables have a central conductor surrounded by \ninsulation, a metallic shield, and an outer cover. They are commonly used for \ncable television, broadband internet, and other high-frequency signal \ntransmission. o Advantages: Higher bandwidth than twisted pair, less interference, and \nbetter signal retention over long distances. o Limitations: Bulkier than twisted pairs, more expensive, and less flexible to \ninstall. • Fiber Optic Cable: \no Description: Fiber optic cables transmit data as pulses of light through \nstrands of glass or plastic. They are used for high-speed data transmission, \nparticularly over long distances and in backbone networks. o Types: \n▪ Single-Mode Fiber (SMF): Transmits one light signal at a time, \nsuitable for long distances and high-bandwidth applications. ▪ Multi-Mode Fiber (MMF): Allows multiple light signals to travel \nthrough the fiber, suitable for shorter distances and lower-cost \napplications. o Advantages: Extremely high bandwidth, low signal loss, and immune to \nelectromagnetic interference. o Limitations: Expensive to install and maintain, requires specialized \nequipment and expertise."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 6,
    "text": "2. Wireless Transmission Mediums (Unguided Media) \nWireless transmission mediums use electromagnetic waves to transmit data without \nphysical cables, offering greater flexibility and mobility. These include: \n• Radio Waves: \no Description: Radio waves can travel long distances and penetrate through \nwalls and obstacles, making them ideal for broadcast communications (e.g., \nAM/FM radio, TV) and mobile communications (e.g., Wi-Fi, cellular \nnetworks). o Advantages: Wide coverage area, good penetration, and suitable for mobile \ncommunication. o Limitations: Susceptible to interference and eavesdropping; bandwidth is \ngenerally limited compared to wired options. • Microwaves: \no Description: Microwaves require a direct line of sight between the \ntransmitter and receiver and are commonly used for satellite \ncommunications and point-to-point links. o Types: \n▪ Terrestrial Microwaves: Used for short-range communication \nbetween ground stations. ▪ Satellite Microwaves: Used for long-range communication, \nbouncing signals off satellites. o Advantages: High bandwidth, suitable for long-distance communication \nwith minimal delays. o Limitations: Requires line of sight, affected by weather conditions, and more \nexpensive to deploy. • Infrared (IR): \no Description: Infrared waves are used for short-range communication, such \nas remote controls and some wireless devices. They require line of sight and \nare primarily used for indoor applications. o Advantages: Secure over short distances, inexpensive, and not affected by \nradio interference. o Limitations: Limited range, requires direct line of sight, and affected by \nobstructions and ambient light."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 7,
    "text": "3. Comparing Wired vs. Wireless Transmission Mediums \n• Wired Media: \no Offers higher reliability, bandwidth, and security. o Best suited for fixed installations where high data rates are required. • Wireless Media: \no Provides greater flexibility and mobility. o Suited for areas where physical cabling is impractical or costly. o Ideal for mobile devices and applications where users need to remain \nconnected on the move. In summary, choosing the right transmission medium depends on various factors such as \nthe required bandwidth, distance, cost, security, and the specific application or \nenvironment. Wired mediums are generally more reliable and suitable for high-speed, fixed \ninstallations, while wireless mediums provide flexibility and ease of access, particularly for \nmobile and temporary setups. Each medium plays a vital role in enabling efficient and \neffective data communication across different types of networks. ****************************************************************************** \nNetworking devices are essential components in a network that facilitate communication \nbetween different devices. Key networking devices include: \n1. Hub: \na. A hub is a basic networking device that connects multiple computers in a \nnetwork. b. It broadcasts data to all devices connected, regardless of the destination, \nmaking it less efficient. c. Works at the physical layer (Layer 1) of the OSI model. 2. Bridge: \na. A bridge connects two or more network segments and filters traffic between \nthem based on MAC addresses. b. It helps reduce traffic by only forwarding data to the correct destination \nsegment. c. Operates at the data link layer (Layer 2). 3. Switch: \na. A switch is more advanced than a hub. It connects devices in a network and \ndirects data to the correct device using MAC addresses."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 8,
    "text": "b. Unlike a hub, a switch only sends data to the specific device it’s intended for, \nimproving efficiency. c. Also operates at the data link layer (Layer 2). 4. Router: \na. A router connects different networks and routes data between them. It uses \nIP addresses to determine the best path for data to travel. b. Operates at the network layer (Layer 3). 5. Gateway: \na. A gateway is a device that connects two different networks, often with \ndifferent protocols. It translates data from one format to another. b. Works at multiple layers, typically including the application layer (Layer 7), \nbut it can involve other layers as well depending on its function. These devices play distinct roles in managing data flow in a network, enhancing efficiency \nand security. *********************************************************************************** \nIn networking, Edge, Access, and Core refer to different layers or segments of a network \ninfrastructure, each serving specific functions: \n1. Edge Network: \na. The edge network is the outermost part of a network, where it interacts with \nexternal networks, such as the internet or other organizations' networks. b. Devices at the edge often include routers, firewalls, and edge switches. c. This layer handles external traffic and secures the internal network from \noutside threats. 2. Access Network: \na. The access network connects end-user devices, like computers, phones, \nand IoT devices, to the network. b. It includes switches, wireless access points, and sometimes hubs that allow \nusers to connect to resources within the network. c. This is where most users interact with the network. 3. Core Network: \na. The core network is the backbone of the entire network, providing high-speed \nand reliable data transmission between different parts of the network. b. It connects multiple access networks and ensures that data flows smoothly \nwithin and across the network."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 9,
    "text": "c. Core routers and switches are used in this layer for fast, efficient data \nforwarding and routing. These layers work together to create a scalable, efficient, and secure network \ninfrastructure. **********************************************************************************88 \nLayered Architecture – OSI and TCP/IP Models \nThe OSI (Open Systems Interconnection) and TCP/IP (Transmission Control \nProtocol/Internet Protocol) models are frameworks used to understand and design \nnetwork communication. OSI Model (7 Layers): \nThe OSI model is a theoretical framework that standardizes networking functions into \nseven distinct layers: \n1. Physical Layer: Transmits raw bitstreams over a physical medium (e.g., cables, \nradio signals). 2. Data Link Layer: Ensures reliable data transfer between two directly connected \nnodes; manages MAC addresses and error detection. 3. Network Layer: Handles packet routing and forwarding across different networks \nusing IP addresses."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 10,
    "text": "4. Transport Layer: Ensures complete data transfer with error detection and \ncorrection, flow control, and retransmission (e.g., TCP, UDP). 5. Session Layer: Manages sessions or connections between applications. 6. Presentation Layer: Translates data formats (e.g., encryption, compression) to \nensure proper data interpretation. 7. Application Layer: Provides network services directly to user applications (e.g., \nHTTP, FTP, SMTP). TCP/IP Model (4 Layers): \nThe TCP/IP model, a more practical framework, forms the basis of the internet. It has four \nlayers: \n1. Network Interface (Link) Layer: Combines the physical and data link layers from \nthe OSI model. It handles hardware addressing and the physical transmission of \ndata. 2. Internet Layer: Corresponds to the OSI's network layer and is responsible for \nrouting and forwarding data across networks using IP. 3. Transport Layer: Similar to OSI's transport layer, it manages end-to-end \ncommunication and data integrity (e.g., TCP, UDP). 4. Application Layer: Combines the OSI's session, presentation, and application \nlayers, providing application-level services like web browsing and email. Key Differences: \n• The OSI model is more detailed (7 layers), while the TCP/IP model is more simplified \n(4 layers). • The OSI model is a reference tool, while the TCP/IP model is based on actual \nprotocols used on the internet. *******************************************************************************88 \nBasic Understanding: \n1. What is the OSI model and why is it important in networking? a. The OSI model is a 7-layer framework that standardizes the functions of a \nnetwork system into layers. It helps understand and troubleshoot network \noperations by breaking them into clear, functional segments. 2. Explain the key functions of each layer in the OSI model."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 11,
    "text": "a. Physical: Transmits raw bits over physical mediums. b. Data Link: Ensures node-to-node data transfer and error detection. c. Network: Handles packet routing and forwarding using IP addresses. d. Transport: Ensures reliable data transfer with flow control, error detection \n(e.g., TCP/UDP). e. Session: Manages and controls communication sessions. f. Presentation: Formats data, handles encryption and compression. g. Application: Provides network services to applications (e.g., HTTP, FTP). 3. What is the TCP/IP model? How does it differ from the OSI model? a. The TCP/IP model is a 4-layer framework used to describe internet \ncommunication. It combines OSI layers into broader categories and is based \non actual protocols (e.g., TCP, IP), unlike the theoretical OSI model. 4. List the layers of the OSI and TCP/IP models and their key protocols. a. OSI: Physical, Data Link, Network, Transport, Session, Presentation, \nApplication. b. TCP/IP: Link (Ethernet), Internet (IP), Transport (TCP/UDP), Application \n(HTTP, FTP). 5. Why was the OSI model developed, and what advantages does it offer? a. The OSI model was developed to standardize networking protocols and \nfacilitate multi-vendor equipment interoperability. It allows for easier \ntroubleshooting and modular development. 6. Which layer of the OSI model handles routing? a. The Network layer handles routing by determining the best path for data \npackets using IP addresses. Comparison and Differences: \n1. Compare and contrast the OSI and TCP/IP models. a. The OSI model has 7 layers, focusing on a clear separation of functions, \nwhile the TCP/IP model has 4 layers and is based on practical protocols used \nin internet communication. TCP/IP combines the OSI’s Presentation, \nSession, and Application layers into one Application layer. 2. Why does the TCP/IP model have fewer layers than the OSI model? a. The TCP/IP model is more simplified, grouping several OSI layers into \nbroader categories, reflecting practical implementations rather than \ntheoretical distinctions. 3. What is the role of the transport layer in both the OSI and TCP/IP models?"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 12,
    "text": "a. In both models, the transport layer ensures end-to-end communication, \ndata integrity, error correction, and flow control using protocols like TCP and \nUDP. 4. Which OSI layers are combined into a single layer in the TCP/IP model? a. The Application, Presentation, and Session layers of the OSI model are \ncombined into the Application layer in the TCP/IP model. 5. In which layer of the OSI model does encryption occur, and how is it handled in \nthe TCP/IP model? a. Encryption typically occurs at the Presentation layer in the OSI model. In \nthe TCP/IP model, encryption is often implemented at the Application layer \n(e.g., HTTPS). Functions and Protocols: \n1. What protocols operate at the transport layer of the TCP/IP model? a. TCP (Transmission Control Protocol) and UDP (User Datagram Protocol) \noperate at the transport layer, providing reliable and unreliable \ncommunication, respectively. 2. Explain the function of the data link layer and its role in error detection. a. The data link layer ensures reliable data transfer between two directly \nconnected devices, using MAC addresses to identify devices. It also \nperforms error detection using checksums and error-correcting codes. 3. How does the network layer in the OSI model handle packet routing? a. The network layer uses IP addresses to determine the best route for packets \nbetween different networks. Routers handle this task, ensuring packets \nreach their destination across interconnected networks. 4. What are the functions of the application layer in the TCP/IP model? a. The application layer provides network services to applications. It manages \nprotocols like HTTP (for web browsing), FTP (for file transfers), and SMTP (for \nemail). Scenario-Based: \n1. In which layer would you troubleshoot network addressing issues, and why? a. Network addressing issues are typically troubleshooted at the Network \nlayer, as it handles logical addressing using IP addresses. 2. If two computers are unable to communicate due to differences in data \nrepresentation, which OSI layer is responsible for resolving this?"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 13,
    "text": "a. The Presentation layer is responsible for resolving differences in data \nformats, encryption, and compression between systems. 3. How does the transport layer handle reliability and flow control in data \ntransmission? a. The transport layer (specifically TCP) ensures reliability through error \ndetection, acknowledgment of data, retransmission of lost packets, and flow \ncontrol mechanisms like windowing. 4. Which layer would be responsible for managing and terminating a session \nbetween two systems? a. The Session layer is responsible for managing, establishing, and terminating \nsessions between two systems, ensuring proper synchronization. **********************************************************************************"
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 1,
    "text": "UNIT III NETWORK LAYER  \n Packet switching - Routing – Distance Vector and Link State Algorithms – RIP, OSPF and BGP - IPV4 \nPacket Format and Addressing – Effective IP address management techniques – Subnetting – CIDR – \nVLSM – DHCP – NAT – ICMP – Need for IPv6 – Addressing methods and types in IPv6 – IPv6 header – \nAdvantages of IPv6 – Transition from IPv4 to IPv6. 1. NETWORK LAYER \n• The transport segment from the sending host is encapsulated into datagrams. • On the receiving side, the segments are delivered to the transport layer by the network layer \nprotocols in every host. • Routers examine header fields in all IP datagrams passing through them. Forwarding: (Getting through a single interchange) packets from a router's input to the appropriate \nrouter output. Routing: (Planning a trip from source to destination) Determines the route taken by packets from source \nto destination. The network layer is the third layer in the OSI model and plays a critical role in end-to-end \ncommunication by providing services such as: \n• Logical addressing: This includes assigning IP addresses to devices on a network to identify them \nuniquely and ensure proper packet delivery. • Routing: It involves determining the best path for data packets to travel from source to \ndestination across multiple networks (e.g., the internet). • Packet forwarding: This refers to the movement of packets across network devices (routers and \nswitches) based on the routing table and logical address. • Fragmentation and reassembly: This process breaks large packets into smaller fragments for \ntransmission over networks with different Maximum Transmission Unit (MTU) sizes, then \nreassembles them at the destination."
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 2,
    "text": "Packet Switching \nDefinition: A method of breaking data into packets for transmission across networks, reassembled at \nthe destination. Types: \n1. Datagram Switching: (Connectionless) Packets take different paths to the destination (e.g., IP \nnetworks). • Advantages: Flexibility, fault tolerance, efficient use of network resources. • Disadvantages: Possibility of packet loss, out-of-order delivery, and delays due to congestion. 2. Virtual Circuit Switching: (Connection-Oriented) A fixed path is established before transmission \n(e.g., MPLS – Multi Protocol Label Switching). • Advantages: More reliable, predictable performance. • Disadvantages: Less flexible, as the path must be predefined and maintained. Virtual Circuit Networks and Datagram Networks: \nFeature \nVirtual Circuit Networks \nDatagram Networks \nConnection \nType \nConnection-oriented (path established \nbefore communication) \nConnectionless (no path established \nbeforehand) \nReliability \nMore reliable (due to fixed path and \nconnection) \nLess reliable (packets may be lost, \nduplicated, or unordered) \nRouting \nFixed path for the entire communication \nsession \nIndependent routing for each packet \nPacket \nDelivery \nPackets follow the same path and are \ndelivered in order \nPackets can take different paths and may \narrive out of order \nError \nHandling \nHandled by the network (dedicated path \nallows easy management) \nHandled by upper layers (e.g., transport \nlayer) \nSetup Time \nRequires setup time to establish the \nconnection \nNo setup time required for communication \nExample \nProtocols \nATM (Asynchronous Transfer Mode), \nFrame Relay, X.25 \nIP (Internet Protocol), UDP \n \nForwarding Table in Virtual Circuits (VC) and Datagram Networks \nVirtual Circuits (VC) \nForwarding Table: In a Virtual Circuit network, each router maintains a forwarding table that maps \nincoming VC numbers to outgoing VC numbers and interfaces. This table is essential for directing the \npackets along the pre-established path."
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 3,
    "text": "Example Forwarding Table:  \nExplanation: \n• Incoming Interface: The interface where the \npacket arrives. • Incoming VC: The virtual circuit number of \nthe incoming packet. • Outgoing Interface: The interface where the \npacket should be forwarded. • Outgoing VC: The virtual circuit number \nassigned to the outgoing packet. Datagram Networks \nForwarding Table: In Datagram Networks, each router maintains a forwarding table that maps IP \naddress prefixes to outgoing interfaces. Each packet is routed independently based on the destination IP \naddress. Signaling Protocols in Virtual Circuits (VC) and Datagram Networks"
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 4,
    "text": "Routing and Forwarding: \n• Routing is about selecting the best path to take across the network. • Forwarding is about sending a packet along that path based on the destination address. Aspect \nRouting \nForwarding \nDefinition \nThe process of determining the best path \nfor packets to take. The process of moving a packet from input to \noutput based on the destination. Performed \nby \nRouters use routing protocols and \nalgorithms to decide on paths. Routers or network devices forward packets \nusing forwarding tables. Timing \nOccurs when a router learns the network \ntopology and updates routing tables. Happens continuously when a packet arrives \nat the router. Scope \nInvolves choosing the overall route from \nsource to destination. Involves deciding the next hop for a specific \npacket. Example \nProtocols \nOSPF, BGP, RIP \nIP forwarding (in routers), MPLS forwarding \n                                              \n \nFlowchart Structure – Routing"
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 5,
    "text": "Graph Extraction: \ngraph: G = (N,E) \nN = set of routers = { u, v, w, x, y, z } \nE = set of links ={ (u,v), (u,x), (v,x), (v,w), (x,w), (x,y), (w,y), \n(w,z), (y,z) } \nc(x,x’) = cost of link (x,x’) \ne.g., c(w,z) = 5 \ncost could always be 1, or inversely related to bandwidth, or inversely related to congestion \ncost of path (x1, x2, x3,…, xp) = c(x1,x2) + c(x2,x3) + … + c(xp-1,xp) \n \nRouting algorithm classification \nBased on Path Calculation Method: \n(i) Static Routing Algorithms: \n• The paths are preconfigured by the network administrator and do not change unless manually \nmodified. • Example: Manual configuration of routes in a router. • Pros: Simple, predictable. • Cons: Not adaptive to network changes, requires manual intervention. (ii) Dynamic Routing Algorithms: \n• The paths are automatically determined and adjusted based on network topology changes and \ntraffic conditions. Routers exchange routing information to adapt to network changes. • Example: RIP, OSPF, BGP. • Pros: Adaptive to changes, can handle network failures and congestion. • Cons: More complex, requires more resources (e.g., processing power and memory). Aspect \nStatic Routing \nDynamic Routing \nConfiguration \nManually set by the admin. Automatically updated by routers. Adaptability \nNo automatic updates. Updates automatically with network \nchanges. Scalability \nBest for small networks. Best for large networks. Overhead \nLow; no need for updates. Higher due to constant updates. Fault Tolerance \nLimited; manual fixes needed. High; reroutes automatically. Examples \nManual routes, Static IP routing. RIP, OSPF, EIGRP, BGP. Pros \nSimple, low overhead. Flexible, adapts to changes. Cons \nInflexible, hard to manage large \nnetworks. More complex, higher overhead."
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 6,
    "text": "ROUTING PROTOCOL \nRouting protocols are vital for ensuring efficient data transmission across networks. This assignment \ndelves into three critical routing protocols: Routing Information Protocol (RIP), Open Shortest Path First \n(OSPF), and Border Gateway Protocol (BGP). While RIP and OSPF are primarily intra-domain protocols, \nBGP operates at the inter-domain level, managing routing across Autonomous Systems (AS). 1. Routing Information Protocol (RIP) \nOverview \nRIP, one of the earliest intra-AS routing protocols, is still utilized in smaller networks due to its simplicity. Defined in: \n• RIP Version 1: [RFC 1058] \n• RIP Version 2: [RFC 2453] (adds backward compatibility and route aggregation). It is a distance-vector protocol based on hop count as the cost metric. Key Mechanisms \n1. Hop Count Metric \na. Each link has a cost of 1 hop. b. Maximum allowable cost: 15 hops, limiting RIP to smaller ASs. 2. Routing Table \nEach router maintains a table with: \na. Destination subnet. b. Next hop router. c. Number of hops to destination. 3. Routing Updates \na. Routers exchange distance vectors (RIP advertisements) every 30 seconds. b. Advertisements include up to 25 subnets. 4. Failure Detection \na. No update within 180 seconds marks the neighbor unreachable. 5. Implementation \na. Application-layer protocol using UDP on port 520. \nb. UNIX uses a routed process for routing updates. RIP Message Format \n \nThe message format is used to share information among different routers. The RIP contains the following \nfields in a message: \n \no Command: It is an 8-bit field that is used for request or reply. The value of the request is 1, and the \nvalue of the reply is 2. \no Version: Here, version means that which version of the protocol we are using. Suppose we are \nusing the protocol of version1, then we put the 1 in this field. o Reserved: This is a reserved field, so it is filled with zeroes. o Family: It is a 16-bit field. As we are using the TCP/IP family, so we put 2 value in this field."
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 7,
    "text": "o Network Address: It is defined as 14 bytes field. If we use the IPv4 version, then we use 4 bytes, \nand the other 10 bytes are all zeroes. o Distance: The distance field specifies the hop count, i.e., the number of hops used to reach the \ndestination. How does the RIP work? If there are 8 routers in a network where Router 1 wants to send the data to Router 3. If the network is \nconfigured with RIP, it will choose the route which has the least number of hops. There are three routes in \nthe above network, i.e., Route 1, Route 2, and Route 3. The Route 2 contains the least number of hops, \ni.e., 2 where Route 1 contains 3 hops, and Route 3 contains 4 hops, so RIP will choose Route 2. Advantages and Disadvantages \nAdvantages \nDisadvantages \nSimplicity, easy setup \nLimited to 15-hop networks \nWidely supported \nSlow convergence (30-second updates) \nDecentralized operations \nVulnerable to count-to-infinity issue \nComparison with OSPF \n• Routing Type: RIP uses distance-vector; OSPF uses link-state. • Scalability: RIP is limited by 15 hops, while OSPF is more scalable. • Convergence: OSPF converges faster than RIP."
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 8,
    "text": "2. Open Shortest Path First (OSPF) \nOverview \nOSPF is a robust and scalable intra-AS link-state routing protocol designed to replace RIP. Defined in \nRFC 2328, it uses Dijkstra’s shortest-path algorithm. Key Mechanisms \n1. Link-State Flooding \na. Broadcasts link-state updates to all routers within an AS. b. Updates are triggered by topology changes or every 30 minutes. 2. Routing Table Calculation \na. Builds a complete AS topology map. b. Shortest-path tree computed using Dijkstra's algorithm. 3. Link Costs \na. Configurable by administrators to reflect hop count, bandwidth, etc. 4. Integration with IP \na. OSPF uses IP protocol 89 and manages its own reliability and authentication. OSPF Message Format \nThe following are the fields in an OSPF message format: \n                                                               \n \no Version: It is an 8-bit field that specifies the OSPF protocol version. o Type: It is an 8-bit field. It specifies the type of the OSPF packet. o Message: It is a 16-bit field that defines the total length of the message, including the header. Therefore, the total length is equal to the sum of the length of the message and header. o Source IP address: It defines the address from which the packets are sent. It is a sending routing \nIP address. o Area identification: It defines the area within which the routing takes place. o Checksum: It is used for error correction and error detection. o Authentication type: There are two types of authentication, i.e., 0 and 1. Here, 0 means for none \nthat specifies no authentication is available and 1 means for pwd that specifies the password-\nbased authentication. o Authentication: It is a 32-bit field that contains the actual value of the authentication data."
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 9,
    "text": "Advanced Features \n• Security: MD5-based authentication ensures message authenticity. • Multiple Same-Cost Paths: Enables load balancing. • Hierarchical Routing: Divides AS into areas connected by Area Border Routers (ABRs). Advantages and Disadvantages \nAdvantages \nDisadvantages \nEfficient convergence \nMore complex configuration \nSuitable for large networks \nHigher memory and CPU usage \nCustomizable link costs \n \n3. Border Gateway Protocol (BGP) \nOverview \nBGP is an inter-domain routing protocol that manages routing between ASs. It is defined in RFC 4271 and \nensures efficient and policy-driven routing on the global Internet. Key Features \n1. Path Vector Protocol \na. Maintains the path information (AS Path) for each destination. b. Avoids routing loops by rejecting routes with its own AS in the path. 2. Policy-Based Routing \na. Allows network operators to define routing policies based on business or technical \nrequirements. 3. Message Types \na. OPEN: Establishes peer connections. b. UPDATE: Communicates route additions/removals. c. KEEPALIVE: Ensures session liveness. d. NOTIFICATION: Indicates errors or session termination. 4. Scalability \na. Suitable for large-scale networks with thousands of ASs. b. Supports CIDR for efficient route aggregation. BGP Packet Format \nNow we will see the format in which the packet travels. The following are the fields in a BGP packet \nformat:"
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 10,
    "text": "1. Marker: It is a 32-bit field which is used for the authentication purpose. 2. Length: It is a 16-bit field that defines the total length of the message, including the header. 3. Type: It is an 8-bit field that defines the type of the packe \n \nAdvantages and Disadvantages \nAdvantages \nDisadvantages \nScalable for large networks \nConfiguration complexity \nPolicy-driven routing \nVulnerable to misconfigurations \nAvoids loops with AS Path \n \nBased on Routing Information Exchange: \n (i) Link-State Routing Algorithm: (GLOBAL): \n• Routers maintain a complete map of the network topology and use this information to calculate the \nbest path. Every router exchanges information about its directly connected links with all other \nrouters. • Example: OSPF (Open Shortest Path First), IS-IS (Intermediate System to Intermediate System). • Working: Routers send link-state advertisements (LSAs) to all other routers, which then use \nalgorithms (like Dijkstra's algorithm) to calculate the shortest paths. • Pros: Faster convergence, avoids routing loops. • Cons: Requires more resources (memory, CPU) for maintaining the topology map. Dijkstra's Algorithm \nDijkstra's algorithm is a fundamental algorithm used in link-state routing protocols like Open Shortest \nPath First (OSPF). It finds the shortest path from a source node to all other nodes in a weighted graph. Steps of Dijkstra's Algorithm \n1. Initialization: \na. Set the distance to the source node as 0. \nb. Set the distance to all other nodes as infinity (∞). c. Mark all nodes as unvisited."
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 11,
    "text": "2. Select Node: \na. Pick the unvisited node with the smallest tentative distance (initially the source node). 3. Update Neighbors: \na. For each unvisited neighbor of the current node: \ni. Calculate the tentative distance: Tentative Distance=Current Distance+Edge \nWeight \nii. If the calculated distance is smaller than the known distance, update it. 4. Mark Visited: \na. Once all neighbors are considered, mark the current node as visited. 5. Repeat: \na. Repeat steps 2–4 until all nodes are visited or the shortest path to the destination is found. Notation Used in Dijkstra's Algorithm \n• G(V,E): A graph with vertices V and edges E. \n• d[u]: The tentative distance from the source node s to node u. • w(u,v): The weight of the edge between nodes u and v. \n• : A priority queue (min-heap) of unvisited nodes, sorted by tentative distance. Example of Dijkstra's Algorithm \nGraph Details: \n• Nodes: A,B,C,D,E,F \n• Edges and Weights: \no A→B: 4 \no A→C: 2 \no B→C: 5 \no B→D: 10 \no C→E: 3 \no E→D: 4 \no E→F: 6 \no D→F: 1 \nInitial State: \nNode Distance from A \nPrevious \nNode \nA \n- \nB \n∞ \n- \nC \n∞ \n- \nD \n∞ \n- \nE \n∞ \n- \nF \n∞ \n- \nExecution: \n1. Start at A: \na. Tentative distances: d[B]=4,d[C]=2. b. Mark A as visited. 2. Move to C (smallest tentative distance):"
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 12,
    "text": "a. Tentative distances: d[E]=5 (via C). b. Mark C as visited. 3. Move to B: \na. Tentative distances: d[D]=14 (via B). b. Mark B as visited. 4. Move to E: \na. Tentative distances: d[D]=9,d[F]=11. b. Mark E as visited. 5. Move to D: \na. Tentative distances: d[F]=10 (via D). b. Mark D as visited. 6. Move to F: \na. All nodes are visited. Final Result: \nNode \nDistance from A \nPreviou\ns Node \nA \n- \nB \nA \nC \nA \nD \nE \nE \nC \nF \nD \n \nDiscussion on Dijkstra's Algorithm \nAdvantages: \n1. Guaranteed Shortest Path: Always finds the shortest path in graphs with non-negative edge \nweights. 2. Efficient: Runs in O(V2) for dense graphs or O((V+E)logV) with a priority queue. 3. Widely Used: Employed in real-world routing protocols like OSPF. Limitations: \n1. Non-Negative Weights Only: Does not work correctly with graphs containing negative weight \nedges. 2. Not Suitable for Frequent Updates: In networks with highly dynamic topology, repeated \nrecalculations can be computationally expensive. Applications: \n• Used in routing protocols (e.g., OSPF) to compute the shortest path. • Traffic engineering and navigation systems. • Network optimization and resource allocation."
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 13,
    "text": "(ii) Distance-Vector Routing Algorithms (DECENTRALIZED): \n• Routers send updates about their routing tables to their neighbors periodically. The distance to a \ndestination is typically measured by the number of hops. • Example: RIP (Routing Information Protocol), BGP (Border Gateway Protocol) (in some modes). • Working: Routers exchange routing tables, and each router updates its table based on information \nfrom neighbors. They calculate the shortest path based on distance metrics (like hop count). • Pros: Simple to implement. • Cons: Slow to converge, prone to routing loops (especially in large networks). Distance vector algorithm \n \n \n \n \nBellman-Ford Algorithm \nclearly, dv(z) = 5, dx(z) = 3, dw(z) = 3B-F equation says: \ndu(z) = min { c(u,v) + dv(z), \nc(u,x) + dx(z), \nc(u,w) + dw(z) } \n= min {2 + 5,1 + 3, 5 + 3} = 4 \nnode achieving minimum is next \nhop in shortest path, used in forwarding table"
  },
  {
    "unit": "Unit 3",
    "topic": "Notes",
    "source": "notes",
    "page": 15,
    "text": "Comparison Table \nAspect \nLink State (LS) \nDistance Vector (DV) \nMessage \nComplexity \n- Each node floods link-state packets \n(LSPs) to all other nodes. - With n nodes and E links: O(nE) \nmessages are sent. - Only exchanges information with direct \nneighbors. - Message complexity depends on \nconvergence time and varies with \nnetwork conditions. Speed of \nConvergence \n- Dijkstra’s algorithm runs in O(n2) time \n(or O(nlogn) with optimized \nimplementations). - Requires O(nE) messages for global \ntopology updates. - May exhibit oscillations under certain \nconditions. - Convergence time is variable and \ndepends on network size and changes. - Susceptible to issues like routing loops \nand count-to-infinity problems, which \nslow down convergence. Robustness \n(Fault \nTolerance) \n- A malfunctioning node can advertise \nincorrect link costs. - Each node computes its own table \nindependently, so errors are localized. - A faulty node can advertise incorrect \npath costs. - Errors can propagate through the \nnetwork as other nodes rely on shared \ndistance vectors. Issues \n- Oscillations may occur during frequent \nupdates or rapid topology changes. - Vulnerable to routing loops, especially \nin the absence of mechanisms like split \nhorizon or poison reverse. - Count-to-infinity problem leads to slow \nerror correction. Error \nPropagation \n- Errors remain localized since each \nnode computes its table based on its \nown topology knowledge. - Errors spread across the network \nbecause each node’s table is used by \nothers to compute paths."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 1,
    "text": "UNIT III NETWORK LAYER  \n Packet switching - Routing – Distance Vector and Link State Algorithms – RIP, OSPF and \nBGP - IPV4 Packet Format and Addressing – Effective IP address management techniques – \nSubnetting – CIDR – VLSM – DHCP – NAT – ICMP – Need for IPv6 – Addressing methods and \ntypes in IPv6 – IPv6 header – Advantages of IPv6 – Transition from IPv4 to IPv6. IPv4 Datagram Header \nCharacteristics of IPv4 \n• IPv4 could be a 32-Bit IP Address. • IPv4 could be a numeric address, and its bits are separated by a dot. • The number of header fields is twelve and the length of the header \nfield is twenty. • It has Unicast, broadcast, and multicast style of addresses. • IPv4 supports VLSM (Virtual Length Subnet Mask)."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 2,
    "text": "• IPv4 uses the Post Address Resolution Protocol to map to the MAC \naddress. • RIP may be a routing protocol supported by the routed daemon. • Networks ought to be designed either manually or with DHCP. • Packet fragmentation permits from routers and causing host. IPv4 Datagram Header \n \n \n• VERSION: Version of the IP protocol (4 bits), which is 4 for IPv4  \n• HLEN: IP header length (4 bits), which is the number of 32 bit words \nin the header. The minimum value for this field is 5 and the \nmaximum is 15. • Type of service: Low Delay, High Throughput, Reliability (8 bits)"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 3,
    "text": "• Total Length: Length of header + Data (16 bits), which has a \nminimum value 20 bytes and the maximum is 65,535 bytes. • Identification: Unique Packet Id for identifying the group of \nfragments of a single IP datagram (16 bits)  \n• Flags: 3 flags of 1 bit each : reserved bit (must be zero), do not \nfragment flag, more fragments flag (same order)  \n• Fragment Offset: Represents the number of Data Bytes ahead of \nthe particular fragment in the particular Datagram. Specified in terms \nof number of 8 bytes, which has the maximum value of 65,528 \nbytes. • Time to live: Datagram’s lifetime (8 bits), It prevents the datagram \nto loop through the network by restricting the number of Hops taken \nby a Packet before delivering to the Destination. • Protocol: Name of the protocol to which the data is to be passed (8 \nbits)  \n• Header Checksum: 16 bits header checksum for checking errors in \nthe datagram header  \n• Source IP address: 32 bits IP address of the sender  \n• Destination IP address: 32 bits IP address of the receiver  \n• Option: Optional information such as source route, record route. Used by the Network administrator to check whether a path is \nworking or not."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 4,
    "text": "The IPv4 packet has a fixed header with a variable-length data section. Key fields in the \nheader: \nField \nSize \n(bits) \nDescription \nVersion \nIPv4 (value = 4) \nHeader Length \nLength of the header in 32-bit words (min = 5, \nmax = 15) \nType of Service (TOS) \nPriority and quality of service options \nTotal Length \nTotal length of the packet (header + data) \nIdentification \nUnique identifier for fragmented packets \nFlags \nControl fragmentation \nFragment Offset \nIndicates the fragment’s position in the \noriginal packet \nTime to Live (TTL) \nLimits the lifetime of the packet (hop count) \nProtocol \nIndicates the higher-layer protocol (e.g., TCP, \nUDP) \nHeader Checksum \nValidates the header’s integrity \nSource Address \nIP address of the sender \nDestination Address \nIP address of the receiver \nOptions \nVariable \nAdditional settings (rarely used) \nData \nVariable \nPayload containing upper-layer protocol \ninformation"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 5,
    "text": "IPv6 Header \n \n \nField \nSize (bits) \nDescription \nVersion \nIPv6 (value = 6) \nTraffic Class \nSimilar to IPv4’s TOS; QoS priority. Flow Label \nIdentifies packets requiring special \nhandling. Payload Length \nLength of the payload (data). Next Header \nIndicates the next protocol (e.g., TCP, \nUDP). Hop Limit \nSimilar to IPv4’s TTL; limits the number of \nhops. Source Address \nIPv6 address of the sender. Destination \nAddress \nIPv6 address of the receiver."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 6,
    "text": "Need for IPv6 \nIPv4 has limitations that necessitated the development of IPv6: \n• \nAddress Exhaustion: IPv4 provides ~4.3 billion addresses, which is insufficient for \nthe growing number of devices. • \nNetwork Growth: IPv6 supports a virtually unlimited number of devices. • \nImproved Security: IPv6 integrates IPsec for secure communication. • \nBetter QoS: IPv6 offers improved Quality of Service (QoS) for real-time applications. • \nSimplified Configuration: IPv6 includes autoconfiguration capabilities, reducing \nadministrative overhead. Addressing Methods and Types in IPv6: \nAddressing \nMethod \nDescription \nUnicast \nIdentifies a single interface; packets are delivered to one specific \nrecipient. Multicast \nIdentifies multiple interfaces; packets are delivered to all members \nof a group. Anycast \nIdentifies multiple interfaces; packets are delivered to the nearest \none in terms of routing distance. Address Type \nPrefix \nDescription \nGlobal Unicast \n2000::/3 \nUnique addresses routable over the internet. Link-Local \nFE80::/10 Automatically configured addresses for communication \nwithin a link; not routable beyond the link. Unique Local \nAddress \nFC00::/7 \nFor local communications; not routable over the internet \nbut unique within an organization."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 7,
    "text": "Multicast \nFF00::/8 \nUsed for multicast groups; packets are delivered to \nmultiple destinations. Unspecified \nAddress \n:: \nRepresents no address (used as a placeholder). Loopback \nAddress \n::1 \nUsed by a device to send packets to itself (loopback \ntesting). Reserved \nAddresses \nVarious \nReserved for special purposes, including future use and \ntesting (e.g., FF02::1 for all nodes). Advantages of IPv6 \n• \nLarger Address Space: IPv6 provides 21282^{128}2128 addresses, far more than \nIPv4's 2322^{32}232. • \nSimplified Header: Improves processing efficiency by routers. • \nImproved Security: Built-in IPsec support for authentication and encryption. • \nAutoconfiguration: Supports stateful (DHCPv6) and stateless (SLAAC) \nconfiguration. • \nBetter Support for Mobile Devices: Allows seamless mobility with minimal \ndisruption. • \nEliminates NAT: Direct addressing removes the need for Network Address \nTranslation. Transition from IPv4 to IPv6 \nChallenges in Transition \n• \nIPv4 and IPv6 are not directly compatible. • \nRequires dual-stack operation and gradual migration. Techniques for Transition \n1. Dual-Stack: Devices run both IPv4 and IPv6 simultaneously. 2. Tunneling: IPv6 packets are encapsulated within IPv4 packets for transport over an \nIPv4 network."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 8,
    "text": "o Examples: 6to4, Teredo, and ISATAP. 3. Translation: Converts IPv4 packets to IPv6 and vice versa using NAT64/DNS64. Effective IP Address Management Techniques: \n1. Subnetting \na. Definition: Dividing a large IP network into smaller, manageable sub-\nnetworks (subnets). b. Purpose: Optimizes IP address usage, improves network performance, and \nenhances security. c. Example: Splitting 192.168.1.0/24 into two subnets: 192.168.1.0/25 \nand 192.168.1.128/25. 2. CIDR (Classless Inter-Domain Routing) \na. Definition: A method to allocate IP addresses efficiently by allowing flexible \nprefix lengths, replacing the rigid class-based addressing. b. Purpose: Reduces wasted IP addresses and simplifies routing. c. Example: Instead of a classful network 192.168.1.0/24, CIDR can allocate \nsmaller networks like 192.168.1.0/28 for 16 addresses. 3. VLSM (Variable Length Subnet Masking) \na. Definition: Extends subnetting by allowing different subnets to have varying \nsizes within the same network. b. Purpose: Maximizes efficient IP address allocation based on the number of \nrequired hosts. c. Example: A 192.168.1.0/24 network can be divided as 192.168.1.0/26 \nfor 64 hosts and 192.168.1.64/27 for 32 hosts. 4. DHCP (Dynamic Host Configuration Protocol) \na. Definition: Automatically assigns IP addresses and other network \nconfigurations to devices. b. Purpose: Simplifies IP management in dynamic or large networks."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 9,
    "text": "c. Example: Assigns IP addresses from a pool (192.168.1.100 to \n192.168.1.200) to devices when they connect. 5. NAT (Network Address Translation) \na. Definition: Allows multiple devices on a private network to access the \nInternet using a single public IP address. b. Purpose: Conserves public IPs, enhances security, and provides IP address \nmapping. c. Example: A private network (192.168.1.0/24) is translated to a single \npublic IP (203.0.113.1) for external communication. 6. ICMP (Internet Control Message Protocol) \na. Definition: Used for diagnostic and error-reporting purposes in network \ncommunication. b. Purpose: Helps identify issues like unreachable hosts or network errors. c. Example: Ping uses ICMP to check the availability and response time of a \nhost. Subnetting \nDefinition: \nSubnetting is the process of dividing a larger IP network into smaller, more manageable \nsub-networks (subnets). Each subnet operates as an independent network while still being \npart of the original larger network. Purpose: \n• Efficient IP Address Utilization: Allocates IP addresses based on specific needs \n(e.g., number of devices per subnet). • Improved Network Performance: Reduces broadcast traffic within each subnet. • Enhanced Security: Isolates sensitive parts of a network. • Simplified Management: Organizes networks logically. Key Concepts \n1. Subnet Mask:"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 10,
    "text": "a. Defines the division between the network and host portions of an IP address. b. Example: 255.255.255.0 (or /24) indicates the first 24 bits represent the \nnetwork. 2. CIDR Notation: \na. Specifies the subnet mask using a / followed by the number of network bits. b. Example: 192.168.1.0/25. 3. Subnet ID and Broadcast Address: \na. Each subnet has a unique ID and broadcast address. b. Example: For 192.168.1.0/25, the subnet ID is 192.168.1.0, and the \nbroadcast address is 192.168.1.127. Subnetting Example \n• Given: Network 192.168.1.0/24. • Task: Create four subnets. • Solution: Increase subnet mask from /24 to /26 (adds 2 bits to the network \nportion). o Subnet Mask: 255.255.255.192 or /26. o Each subnet has 2^6 = 64 addresses (62 usable for hosts). Subnets: \nSubnet ID \nFirst Host \nLast Host \nBroadcast Address \n192.168.1.0/26 \n192.168.1.1 \n192.168.1.62 \n192.168.1.63 \n192.168.1.64/26 \n192.168.1.65 \n192.168.1.126 \n192.168.1.127 \n192.168.1.128/26 192.168.1.129 \n192.168.1.190 \n192.168.1.191 \n192.168.1.192/26 192.168.1.193 \n192.168.1.254 \n192.168.1.255 \n \nBenefits of Subnetting: \n1. Conserves IP Addresses: Reduces wastage in larger networks. 2. Limits Broadcast Domains: Ensures less traffic and better performance. 3. Logical Organization: Facilitates departmental or geographical segregation. Supernetting \nDefinition:"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 11,
    "text": "Supernetting is the process of combining multiple smaller, contiguous networks (subnets) \ninto a single larger network (supernet). It is the inverse of subnetting and is typically used in \nrouting to reduce the size of routing tables. Purpose: \n• Simplifies routing by aggregating multiple routes into a single entry. • Optimizes the allocation of IP addresses. • Reduces the load on routers and improves efficiency in large networks \nKey Features: \n1. Combines Networks: Merges multiple networks with contiguous IP address \nranges. 2. Flexible Masking: Uses a shorter subnet mask to include more addresses in a \nsingle block. 3. Classless: Like CIDR, supernetting ignores traditional class boundaries (Class A, B, \nC). Example: \nSuppose you have four Class C networks: \n• 192.168.1.0/24 \n• 192.168.2.0/24 \n• 192.168.3.0/24 \n• 192.168.4.0/24 \nTo supernet these, a shorter prefix /22 can represent them as a single block: \n• Supernet: 192.168.0.0/22 \n• Address Range: 192.168.0.0 to 192.168.3.255. Benefits: \n1. Reduces routing table size by advertising one route instead of four. 2. Simplifies network management. 3. Minimizes overhead in routers. Applications:"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 12,
    "text": "• Used by ISPs for route aggregation to advertise fewer routes. • Optimizes large-scale enterprise networks with contiguous IP address blocks. 1. CIDR (Classless Inter-Domain Routing) \n• Definition: A method for allocating IP addresses and routing by allowing flexible \nsubnet masks instead of fixed class-based masks (Class A, B, C). • Purpose: Optimizes IP address allocation and reduces routing table size. • Key Features: \no Uses prefix length to define networks (e.g., 192.168.1.0/24 for 256 \naddresses). o Aggregates routes to minimize entries (e.g., 192.168.0.0/16 combines \nmultiple /24 subnets). • Example: \nInstead of allocating a full Class B network (172.16.0.0/16), CIDR allows creating a \nsmaller network, such as 172.16.0.0/20 for 4,096 addresses. STEPS TO CONVERT SUBNET TO CIDR \n1. Write the subnet mask in decimal notation. Example: 255.255.255.0. 2. Convert the decimal subnet mask into binary. o 255.255.255.0 becomes 11111111.11111111.11111111.00000000. 3. Count the number of 1 bits in the binary subnet mask. o Here, there are 24 ones. 4. The CIDR notation is the number of 1s. o For the example 255.255.255.0, the CIDR is /24. Examples \n1. Subnet Mask: 255.255.255.128 \no Binary: 11111111.11111111.11111111.10000000 \no Number of 1s: 25 \no CIDR: /25"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 13,
    "text": "2. Subnet Mask: 255.255.252.0 \no Binary: 11111111.11111111.11111100.00000000 \no Number of 1s: 22 \no CIDR: /22 \n \nSteps to Convert CIDR to Subnet Mask \n1. Identify the CIDR Prefix \nThe number after the / in CIDR represents the number of 1s in the subnet mask. For \nexample, /20 means the subnet mask has 20 1s. 2. Write the Binary Subnet Mask \nWrite 1s for the prefix length and fill the rest with 0s to make a total of 32 bits. Example for /20: 11111111.11111111.11110000.00000000. 3. Convert Each Octet from Binary to Decimal \nBreak the 32-bit binary string into four 8-bit segments (octets) and convert each to \ndecimal. Example: 11111111.11111111.11110000.00000000 → 255.255.240.0. Example Conversions \nCIDR Binary Subnet Mask \nDecimal Subnet Mask \n/16 \n11111111.11111111.00000000.00000000 255.255.0.0 \n/24 \n11111111.11111111.11111111.00000000 255.255.255.0 \n/27 \n11111111.11111111.11111111.11100000 255.255.255.224 \n/30 \n11111111.11111111.11111111.11111100 255.255.255.252"
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 14,
    "text": "2. VLSM (Variable Length Subnet Masking) \n• Definition: Extends subnetting by allowing subnets of different sizes within the \nsame network. • Purpose: Efficiently uses IP addresses by matching the subnet size to the number \nof required hosts. • Key Features: \no Avoids IP wastage by creating subnets based on host requirements. o Compatible with CIDR. • Example: \nFrom 192.168.1.0/24: \no /26 for 64 hosts (e.g., 192.168.1.0/26). o /27 for 32 hosts (e.g., 192.168.1.64/27). o /30 for point-to-point links (e.g., 192.168.1.96/30). 3. DHCP (Dynamic Host Configuration Protocol) \n• Definition: A protocol that dynamically assigns IP addresses and other network \nsettings to devices. • Purpose: Simplifies IP management in networks with frequently changing devices. • Key Features: \no Centralized IP allocation. o Prevents conflicts by ensuring unique IPs. o Can also configure DNS, default gateway, and subnet masks. • Example Workflow: \no A device sends a DHCP Discover message. o The DHCP server replies with a DHCP Offer. o The device accepts using a DHCP Request. o The server confirms with a DHCP Acknowledgement. 4. NAT (Network Address Translation) \n• Definition: A technique where private IP addresses are translated to a public IP \naddress for external communication."
  },
  {
    "unit": "Unit 1",
    "topic": "Notes",
    "source": "notes",
    "page": 15,
    "text": "• Purpose: Conserves public IP addresses and enhances security. • Key Features: \no Static NAT: Maps a private IP to a specific public IP. o Dynamic NAT: Maps private IPs to a pool of public IPs. o PAT (Port Address Translation): Multiple private IPs share a single public IP \nusing unique ports. • Example: \no Internal Network: 192.168.0.0/24. o External IP: 203.0.113.1. \no Devices with private IPs access the internet using 203.0.113.1. 5. ICMP (Internet Control Message Protocol) \n• Definition: A protocol used for diagnostic and error-reporting in IP networks. • Purpose: Helps identify network issues such as unreachable hosts or congestion. • Key Features: \no Works alongside IP but does not transfer data. o Generates error messages (e.g., \"Destination Unreachable\"). o Used by tools like ping and traceroute. • Example Uses: \no Ping: Sends ICMP Echo Request to check if a host is reachable. o Traceroute: Uses ICMP to map the path packets take to a destinatio"
  }
]